package org.example.lessons.lesson04

class Datatypes {
    val v1 = 42
    val v2 = 98765432123456789L
    val v3 = 23.45f
    val v4 = 0.123456789
    val v5 = "Kotlin & Java"
    //val v6 = FALSE - тут строчная false

    // val v7 = 'c' - кавычки должны быть "", если это String
    val v8 = 500
    val v9 = 4294967296L
    val v10 = 18.0f
    val v11 = -0.001
    val v12 = "OpenAI"
    val v13 = "true"
    val v14 = listOf(3, 14)

    //val v15 = '9' - кавычки должны быть "", если это String
    val v16 = 2048
    val v17 = 10000000000L
    val v18 = setOf("OpenAI", "Quantum Computing")
    val v19 = 5.75f

    // val v20 = `1.414`  - кавычки должны быть "", если это String
    val v21 = "Artificial Intelligence"
  //  val v22 = arrayOf('x', "A") - String в "" кавычках должен быть
    val v23 = "Android Studio"

    //val v24 = '@'  - кавычки должны быть "", если это String
    val v25 = 1024
    val v26 = 1234567890123L
    val v27 = 10.01f
    val v28 = -273.15
    val v29 = "SpaceX"

    //val v30 = FALSE - тут строчная false
    val v31 = 0.007

    // val v32 = “🤯”  - кавычки должны быть "", если это String
    val v33 = mapOf("true" to 2, "false" to 34)

    //val v34 = ‘65535’ - кавычки должны быть "", если это String
    val v35 = 72057594037927935L
    val v36 = 2.71828f
    val v37 = 101.0101
    val v38 = "Quantum Computing"
    val v39 = mapOf(2 to "true", 34 to "false")

    // val v40 = 'x' - кавычки должны быть "", если это String
    val v41 = 314
    val v42 = 123456789123456789L
    val v43 = 6.626f
    //val v44 = TRUE - тут строчная true

    Char   -  Хранить букву, на которую указывает палец медиума во время спиритического сеанса.
    Int - Хранить количество ложек сахара, которые я кладу в одну чашку чая.
    List<String> - Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле.
    Long - Хранить длину очереди в столовой до миллиардной доли сантиметра.
    Boolean - Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу.
    Int - Хранить количество свистков чайника за день.
    Long - Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы.
    Long - Хранить количество попыток пересчитать звёзды на небе за всю историю человечества.
    Float - Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма.
    Map<String, Int>  - Хранить словарь «название стартапа → сумму потерь инвесторов».
    String  - Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов.
    List<String> - Хранить список тем для митингов, которые на самом деле никому не нужны.
}